In [3]:
import pandas as pd
import numpy as np

# Q.1

In [37]:
student_df = pd.DataFrame([{'Name':'James','School':'Business'},
                          {'Name':'Mike','School':'Law'},
                          {'Name':'Sally','School':'Engineering'}])
staff_df = pd.DataFrame([{'Name':'Kelly','Role':'Director of HR'},
                         {'Name':'Sally','Role':'Course liaison'},
                        {'Name':'James','Role':'Grader'}])

In [41]:
staff_df.set_index("Name", inplace = True)

In [42]:
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liaison
James          Grader

In [43]:
student_df = student_df.set_index('Name')

In [44]:
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [48]:
pd.merge(staff_df, student_df, how='right', left_index = True, right_index = True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liaison  Engineering

# Q.2

In [49]:
df1 = pd.DataFrame(np.random.randint(10,100,(5,6)), columns = ['P2010', 'P2011', 'P2012', 'P2013','P2014', 'P2015'])

In [50]:
df1

   P2010  P2011  P2012  P2013  P2014  P2015
0     75     89     82     78     37     92
1     42     26     40     52     26     32
2     31     74     55     28     19     62
3     13     21     79     37     34     99
4     58     67     18     51     71     90

In [52]:
frames = ['P2010', 'P2011', 'P2012', 'P2013','P2014', 'P2015']
df1['AVG'] = df1[frames].apply(lambda z: np.mean(z), axis = 1)
print(df1)

   P2010  P2011  P2012  P2013  P2014  P2015        AVG
0     75     89     82     78     37     92  75.500000
1     42     26     40     52     26     32  36.333333
2     31     74     55     28     19     62  44.833333
3     13     21     79     37     34     99  47.166667
4     58     67     18     51     71     90  59.166667

In [53]:
result_df = df1.drop(frames, axis = 1)
result_df

         AVG
0  75.500000
1  36.333333
2  44.833333
3  47.166667
4  59.166667

# Q.3

In [59]:
#import pandas as pd
df = pd.DataFrame(['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'], columns = ['Grades'])
#my_categories= pd.CategoricalDtype(categories=['A+', 'A', 'A-', 'B+', 'B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'], ordered = True)
my_categories= pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'], ordered = True)
grades = df['Grades'].astype(my_categories)
result = grades[(grades>'B') & (grades<'A')]
print(result)

excellent    A-
good         B+
Name: Grades, dtype: category
Categories (11, object): [D < D+ < C- < C ... B+ < A- < A < A+]

# Q.4

In [4]:
dfq = pd.read_csv('../resources/week-3/datasets/cwurData.csv')
dfq.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [6]:
def create_category(ranking):
    if (ranking >=1) & (ranking<=100):
        return 'First Tier Top University'
    elif (ranking >= 101) & (ranking <= 200):
        return 'Second Tier Top University'
    elif (ranking >=201) & (ranking <= 300):
        return 'Third Tier Top University'
    else:
        return 'Other Tier Top Universities'
    
    
dfq['Rank Level'] = dfq['world_rank'].apply(lambda x: create_category(x))

dfq.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,Rank Level
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012,First Tier Top University
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012,First Tier Top University
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012,First Tier Top University
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012,First Tier Top University
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012,First Tier Top University

In [9]:
dfq_pivot = dfq.pivot_table(values = 'score', index='country', columns = 'Rank Level', aggfunc=[np.median])
dfq_pivot.head()

                              median                              \
Rank Level First Tier Top University Other Tier Top Universities
country
Argentina                        NaN                      44.390
Australia                     48.055                      44.580
Austria                          NaN                      44.630
Belgium                       51.875                      44.715
Brazil                           NaN                      44.365


Rank Level Second Tier Top University Third Tier Top University
country
Argentina                         NaN                       NaN
Australia                      49.125                    47.285
Austria                           NaN                    47.030
Belgium                        49.600                    46.890
Brazil                         49.565                       NaN

In [10]:
dfq_pivot2 = dfq.pivot_table(values = 'score', index='country', columns = 'Rank Level', aggfunc=[np.median], margins = True)
dfq_pivot2.head()

                              median                              \
Rank Level First Tier Top University Other Tier Top Universities
country
Argentina                        NaN                      44.390
Australia                     48.055                      44.580
Austria                          NaN                      44.630
Belgium                       51.875                      44.715
Brazil                           NaN                      44.365


Rank Level Second Tier Top University Third Tier Top University     All
country
Argentina                         NaN                       NaN  44.390
Australia                      49.125                    47.285  44.765
Austria                           NaN                    47.030  44.690
Belgium                        49.600                    46.890  46.210
Brazil                         49.565                       NaN  44.380

# Q.5

In [11]:
(pd.Timestamp('11/29/2019') + pd.offsets.MonthEnd()).weekday()

5

# Q.9

In [12]:
pd.Period('01/12/2019', 'M') + 5

Period('2019-06', 'M')

# Q.10

In [13]:
dff = pd.DataFrame([['apple', 'fruit',95],['mango','fruit',202],['potato','vegetable',67]])
dff.head()

        0          1    2
0   apple      fruit   95
1   mango      fruit  202
2  potato  vegetable   67

In [14]:
dff.columns = ['Name','class','avg calories per unit']
dff.head()

     Name      class  avg calories per unit
0   apple      fruit                     95
1   mango      fruit                    202
2  potato  vegetable                     67

In [15]:
dff.set_index('Name', inplace = True)
dff.head()

            class  avg calories per unit
Name
apple       fruit                     95
mango       fruit                    202
potato  vegetable                     67

In [31]:
df_grp = dff.groupby('class')
df_grp.groups

{'fruit': Index(['apple', 'mango'], dtype='object', name='Name'),
 'vegetable': Index(['potato'], dtype='object', name='Name')}

# Answers

# Q.1 - b
# Q.2 - d
# Q.3 - b
# Q.4 - c
# Q.5 - a
# Q.6 - a
# Q.7 - d
# Q.8 - c
# Q.9 - a
# Q.10 - b